###############################################################################
# Created by write_sdc
###############################################################################
current_design adder32
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 125.0000 
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[0]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[10]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[11]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[12]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[13]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[14]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[15]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[16]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[17]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[18]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[19]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[1]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[20]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[21]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[22]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[23]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[24]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[25]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[26]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[27]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[28]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[29]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[2]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[30]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[31]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[3]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[4]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[5]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[6]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[7]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[8]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {A[9]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[0]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[10]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[11]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[12]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[13]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[14]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[15]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[16]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[17]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[18]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[19]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[1]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[20]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[21]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[22]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[23]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[24]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[25]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[26]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[27]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[28]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[29]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[2]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[30]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[31]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[3]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[4]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[5]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[6]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[7]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[8]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {B[9]}]
set_input_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {Ci}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {Co}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[0]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[10]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[11]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[12]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[13]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[14]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[15]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[16]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[17]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[18]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[19]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[1]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[20]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[21]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[22]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[23]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[24]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[25]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[26]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[27]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[28]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[29]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[2]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[30]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[31]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[3]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[4]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[5]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[6]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[7]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[8]}]
set_output_delay 25.0000 -clock [get_clocks {core_clock}] -add_delay [get_ports {S[9]}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
